CSI API ETABS v1
cDetailing.GetSimilarBeamLines_1 Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSimilarBeamLines_1(
	string TowerName,
	string StoryName,
	string BeamLineID,
	ref int NumberSimilarBeams,
	ref int[] NumberUniqueObjects,
	ref string[] ObjectUniqueNames
)
Function GetSimilarBeamLines_1 (
	TowerName As String,
	StoryName As String,
	BeamLineID As String,
	ByRef NumberSimilarBeams As Integer,
	ByRef NumberUniqueObjects As Integer(),
	ByRef ObjectUniqueNames As String()
) As Integer
Dim instance As cDetailing
Dim TowerName As String
Dim StoryName As String
Dim BeamLineID As String
Dim NumberSimilarBeams As Integer
Dim NumberUniqueObjects As Integer()
Dim ObjectUniqueNames As String()
Dim returnValue As Integer
returnValue = instance.GetSimilarBeamLines_1(TowerName,
	StoryName, BeamLineID, NumberSimilarBeams,
	NumberUniqueObjects, ObjectUniqueNames)
int GetSimilarBeamLines_1(
	String^ TowerName,
	String^ StoryName,
	String^ BeamLineID,
	int% NumberSimilarBeams,
	array<int>^% NumberUniqueObjects,
	array<String^>^% ObjectUniqueNames
)
abstract GetSimilarBeamLines_1 :
        TowerName : string *
        StoryName : string *
        BeamLineID : string *
        NumberSimilarBeams : int byref *
        NumberUniqueObjects : int[] byref *
        ObjectUniqueNames : string[] byref -> int
Parameters
TowerName
Type: System.String
StoryName
Type: System.String
BeamLineID
Type: System.String
NumberSimilarBeams
Type: System.Int32
NumberUniqueObjects
Type: System.Int32[]
ObjectUniqueNames
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDetailing Interface
ETABSv1 Namespace